Sanjith-Shan/Echolocate/firmware/sdkconfig.defaults
# Echolocate ESP32-S3 sdkconfig overlay
# Apply with: cp sdkconfig.defaults sdkconfig  (or: idf.py reconfigure)

# Target
CONFIG_IDF_TARGET="esp32s3"

# UART speed: matches backend SERIAL_BAUD default (921600)
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600

# WiFi: enable CSI
CONFIG_ESP_WIFI_CSI_ENABLED=y

# WiFi: increase static RX buffers so CSI doesn't drop
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64

# HTTP server: enable
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# FreeRTOS: CSI callback runs in WiFi task; main task gets bigger stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging: keep info-level so the boot banner shows the IP
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Disable Wi-Fi NVS — not needed for hackathon, simpler boot
CONFIG_ESP_WIFI_NVS_ENABLED=n

# PSRAM: enable octal SPIRAM for ESP32-S3-WROOM-1 N16R8
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Flash size: 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
